SET NAMES 'utf8';
USE app_myjiaju;
CREATE TABLE ts_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO ts_dish(did,name,img_sm,img_lg,price,detail,material)VALUES
(   null,
    '【欧式卧室衣柜】',
    'gear-1.jpg',
    'sgear-1.jpg',
    1800.00,
    'MDF板、PU发泡、夹板、松木皮、二节钢珠滑轨和金色效果拉手',
    '此款欧式家具图片选用了MDF板、PU发泡、夹板、松木皮、二节钢珠滑轨和金色效果拉手作为主要材质，家具图片展示的衣柜看上去清新脱俗，自然大气，简单而不失时尚，呈现出一款唯美的田园风格四门卧室衣柜。衣柜开始使用后要多让其透气，或是定期使用除湿剂，以免柜体、衣物受潮生菌。'
),
(   null,
    '【北欧创意茶几和休闲舒适座椅】',
    'gear-2.jpg',
    'sgear-2.jpg',
   1666.00,
    'E1级高密度板,优质钢琴烤漆',
    '北欧风情，生活梦想，远离时间的繁华用质朴、实用、简单的生活，节约空间，不再为空间小而烦恼，茶几采用E1级高密度板制作而成，采用优质钢琴烤漆，收纳空间大，清晨初醒，窗外迎接我们的便是那一缕缕温煦的阳光，从窗外斜射进来，茶几在客厅显得那么简约动人。'
),
(   null,
    '【正方形茶几】',
    'gear-3.jpg',
    'sgear-3.jpg',
    588.00,
    '材质包含水冬瓜和中纤板',
    '谁说茶几就一定得是长方形的，这款欧式家具图片中展示的茶几就是正方形的，主要材质包含水冬瓜和中纤板，整个家具图片看上去非常美观，此款小方几双层结构，款式简单大方，实用性很强，茶几没有很明显的茶几脚，艺术效果突出。只是要避免阳光长时间直射，以免造成产品局褪色或泛黄，并保持使用环境清洁、干燥、通风，以免受潮。'
),
(   null,
    '【欧式时尚床垫。皮床和席梦思】',
    'gear-4.jpg',
    'sgear-4.jpg',
    1556.00,
    '主要材质有松木、pu发泡埋实木、PU发泡、白杨夹板、黄牛二层真皮',
    '这款欧式家具图片展示出的皮床主要材质有松木、pu发泡埋实木、PU发泡、白杨夹板、黄牛二层真皮以及MDF贴纸组成，家具图片展示的皮床柔和的象牙白色，简约的设计，表现出了一种恬淡陶然的田园情怀。不过使用过程要避免阳光长时间直射，以免造成产品局褪色或泛黄，并保持使用环境清洁、干燥、通风。'
),
(   null,
    '【客厅简约白色和绿色茶几和大气沙发】',
    'gear-5.jpg',
    'sgear-5.jpg',
    1288.00,
    '钢琴烤漆、木纹清晰精选优质真皮材料',
    '优质家具，四大卖点：钢琴烤漆、木纹清晰、镂空设计、光亮面板，稳定性好，不渗色，亮度高，精选优质真皮材料，材质更耐用，胡桃木饰面，木纹精巧别致，清晰大方，结构细而匀，不易开裂，变形,简约的设计，表现出了一种恬淡陶然的田园情怀。'
),
(   null,
    '【真皮靠背沙发座椅和古朴茶几】',
    'gear-6.jpg',
    'sgear-6.jpg',
    1099.00,
    '胡桃木饰面,黄牛二层真皮',
    '家具图片为三个深色豪华大气的沙发以及一个古典简约茶几，企业直营，质量保证，不渗色，亮度高，精选优质真皮材料，材质更耐用，胡桃木饰面，木纹精巧别致，清晰大方，结构细而匀，只是要避免阳光长时间直射，以免造成产品局褪色或泛黄，并保持使用环境清洁、干燥、通风，以免受潮。'
),
(   null,
    '【电脑椅家用办公椅子弓形会议椅】',
    'gear-7.jpg',
    'sgear-7.jpg',
    299.00,
    '五星钢制脚材质，具有固定扶手',
    '特价办公椅，多色可选！企业直营，质量保证，售货一年质保，五星钢制脚材质，具有固定扶手，支持人体工程学，款式定位为经济型，靠背高度为50cm，可以有效缓解疲劳。独特而别致的产品设计，彰显它特有的魅力。我们坚持走在时尚前端，将时尚与品质融为一体。多出考虑人体曲线设计。'
),
(   null,
    '【复古桌椅组合 碳化防腐木餐桌喝茶桌椅】',
    'gear-8.jpg',
    'sgear-8.jpg',
    566.00,
    '碳化结实，鲁班拼接法，原生态拼接，手工成型',
    '承载自然之美，诠释每一件产品上的实木精神，从家具中发现艺术继而品味艺术，提高生活品质，坚持实木文化，不应仅限于产品本身，而是一种态度，生活的态度。纯粹、自然、时尚、素雅，碳化更结实，鲁班拼接法，原生态拼接，纯实木打造。自然原生态实木餐桌，环保健康。极致体验，手工成型。'
);
##SELECT * FROM ts_dish;
/*用户表*/
CREATE TABLE ts_users(
    userid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    uname VARCHAR(20),                     /*用户名*/
    pwd VARCHAR(20),                       /*密码*/
    phone VARCHAR(20)                      /*电话*/
);
INSERT INTO ts_users VALUES
(NULL,'mary','11111','13111112345'),
(NULL,'jerry','22222','13819196547'),
(NULL,'john','33333','13819196547');
/*订单表*/
CREATE TABLE ts_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,     /*订单ID*/
    userid INT,                             /*用户*/
    phone VARCHAR(16),                      /*联系电话*/
    user_name VARCHAR(16),                  /*收货方用户名*/
    order_time LONG,                        /*下单时间*/
    addr VARCHAR(256),                      /*订单地址*/
    totalprice FLOAT(6,2)                   /*订单总价*/
);
INSERT INTO ts_order VALUES
(NULL,1,'13501234567','小明',1445154859209,'大钟寺中鼎B座',20.5),
(NULL,1,'13501257543','琳妹妹',1445154997543,'大钟寺中鼎B座',12.5),
(NULL,2,'13207654321','王浩',1445254997612,'大钟寺中鼎B座',55),
(NULL,2,'13899999999','文兄',1445354959209,'大钟寺中鼎B座',35),
(NULL,3,'13683675299','宝哥哥',1445355889209,'大钟寺中鼎B座',45);
/**购物车表**/
CREATE TABLE ts_cart(
    ctid INT PRIMARY KEY AUTO_INCREMENT, /*购物车编号*/
    userid INT,                          /*用户编号：假定有用户id为 1 和 3 的两个用户有数据*/
    did INT,                             /*产品编号*/
    dishCount INT                      /*数量*/
);
INSERT INTO ts_cart VALUES (1,1,1,1),
(2,1,2,4),
(3,1,5,2),
(4,3,2,10),
(5,3,6,1);
##SELECT * FROM ts_order;
/**订单详情表**/
CREATE TABLE ts_orderdetails(
    oid INT ,                            /*订单编号*/
    did INT,                             /*产品id*/
    dishCount INT,                     /*购买数量*/
    price FLOAT(8,2)                     /*产品单价：需要记载，因为产品价格可能波动*/
);
INSERT INTO ts_orderdetails VALUES (1,1,2,5),
(1,2,1,10.5),
(2,3,1,12.5),
(3,1,3,5),
(3,2,4,10),
(4,4,7,5),
(5,5,5,4),
(5,6,2,12.5);
